In [15]:
import pandas as pd

# Creating data

In [16]:
pd.DataFrame({'Yes':[2,3],'No':[454,55]})

   Yes   No
0    2  454
1    3   55

In [17]:
pd.DataFrame({'Name':['Farhana','Pirih','Durdana'],'Age':[22,21,24]})

      Name  Age
0  Farhana   22
1    Pirih   21
2  Durdana   24

In [18]:
pd.DataFrame({'Pressure':[23.4,55,456,453,55.5],'Temoerature':[34,45,67,76,66]})

   Pressure  Temoerature
0      23.4           34
1      55.0           45
2     456.0           67
3     453.0           76
4      55.5           66

In [19]:
pd.DataFrame({'EmpId':['18sw53','18sw55','18sw49'],'EmployeeName':['Farhana','Pirih Sahito','Durdana Khalid']})

    EmpId    EmployeeName
0  18sw53         Farhana
1  18sw55    Pirih Sahito
2  18sw49  Durdana Khalid

In [21]:
pd.DataFrame({'StudentId':['18sw53','18sw55','18sw49'],'age':[22,21,24],'Year':['2nd','3rd','3rd'],'Attandence':['78%','90%','80%']})

  StudentId  age Year Attandence
0    18sw53   22  2nd        78%
1    18sw55   21  3rd        90%
2    18sw49   24  3rd        80%

In [24]:
pd.DataFrame({'Age':[22,34,55,67],'Name':['Farhana','Pirih','Durdana','Ali']},index=['n1','n2','n3','n4'])

    Age     Name
n1   22  Farhana
n2   34    Pirih
n3   55  Durdana
n4   67      Ali

# Series is a list

In [26]:
pd.Series([1,2,3,4,5,6,7,8,9])

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [27]:
pd.Series([33,34,35,36,37,38,39,40])

0    33
1    34
2    35
3    36
4    37
5    38
6    39
7    40
dtype: int64

In [28]:
pd.Series([22,23,24,25],index=['Age1','age2','age3','age4'])

Age1    22
age2    23
age3    24
age4    25
dtype: int64

# Reading data files

In [29]:
df=pd.read_csv('winemag-data_first150k.csv')

In [30]:
df.head()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi
4,4,France,"This is the top wine from La Bégude, named aft...",La Brûlade,95,66.0,Provence,Bandol,NaN,Provence red blend,Domaine de la Bégude

# We can use the shape attribute to check how large the resulting DataFrame is

In [32]:
df.shape

(150930, 11)